/*
Task-1/5 5. Создайте программу, которая запрашивает у пользователя два целых числа
**a** и **b**, после чего выводит на экран результаты следующих математических операций: 
- сумма a и b; 
- разница между a и b;
- произведение a и b; 
- частное от деления a на b; 
- остаток от деления a на b;  
- результат возведения числа a в степень b 
*/

let a = +prompt("Integer number?", 10);
let b = +prompt("Another integer number?", 2);

let add = a + b;
let sub = a - b;
let mult = a * b;
let div = a / b;
let rem = a % b;
let exp = a ** b;

alert(`
${a} + ${b} = ${add}\n${a} - ${b} = ${sub}\n${a} * ${b} = ${mult}
${a} / ${b} = ${div}\n${a} % ${b} = ${rem}\n${a} ** ${b} = ${exp}
`)